{"msg":"hartm","username":"rjones","ts":"2020-02-28T23:02:04.491Z","type":"subscription-role-added"}
{"msg":"User <em>User_1</em> added by <em>rjones</em>.","username":"rjones","ts":"2020-02-28T23:02:49.420Z","type":"au"}
{"msg":"User <em>User_2</em> added by <em>rjones</em>.","username":"rjones","ts":"2020-02-28T23:02:49.447Z","type":"au"}
{"msg":"shemnon","username":"rjones","ts":"2020-02-28T23:03:41.614Z","type":"subscription-role-added"}
{"msg":"have fun!","username":"rjones","ts":"2020-02-28T23:03:46.466Z"}
{"msg":"Thanks @rjones !","username":"hartm","ts":"2020-02-28T23:57:43.593Z"}
{"msg":"Adding @seanyoung ","username":"hartm","ts":"2020-02-28T23:58:02.871Z"}
{"msg":"I don't see a way to move or copy the previous conversation over, so it's up to you all to handle the `state`","username":"rjones","ts":"2020-02-28T23:59:15.526Z"}
{"msg":"side-channel context switching attacks on your cortex","username":"rjones","ts":"2020-02-28T23:59:35.914Z"}
{"msg":"I think we'll be fine.  Our original conversation was probably a tiny-text-attack on the TSC...","username":"hartm","ts":"2020-02-29T00:00:26.451Z"}
{"msg":"Has left the channel.","username":"rjones","ts":"2020-02-29T00:25:43.308Z","type":"ul"}
{"msg":"Hello\nSo I think it would be great to get the right people together to work on a standard set of wasm host functions. Who should we invite and what would be the best way to go about it?","username":"seanyoung","ts":"2020-02-29T02:29:50.402Z"}
{"msg":"I think we may want to check in with the smart contracts working group to get a list of interested parties.","username":"shemnon","ts":"2020-02-29T03:57:19.831Z"}
{"msg":"User <em>User_3</em> added by <em>seanyoung</em>.","username":"seanyoung","ts":"2020-02-29T05:22:31.372Z","type":"au"}
{"msg":"User <em>User_4</em> added by <em>seanyoung</em>.","username":"seanyoung","ts":"2020-02-29T05:22:31.392Z","type":"au"}
{"msg":"@shubham_aggarwal @amundson would be great to work together to work on standard wasm host interface functions in Fabric and Sawtooth Sabre. Please let us know what you think, thank you.","username":"seanyoung","ts":"2020-02-29T05:24:24.186Z"}
{"msg":"seems like sabre has already defined it?","username":"amundson","ts":"2020-02-29T05:42:38.296Z"}
{"msg":"fabric should adopt transact so we can use sabre (and other future smart contract engines) across projects.","username":"amundson","ts":"2020-02-29T05:56:35.236Z"}
{"msg":"Sounds great @seanyoung. We have mapped a few fabric shim functions as basic host wasm interfaces here: https://github.com/hyperledger-labs/fabric-chaincode-wasm\n\nWe can start working out on standardizing it","username":"shubham_aggarwal","ts":"2020-02-29T07:17:39.273Z"}
{"msg":"@shubham_aggarwal great, thank you very much","username":"seanyoung","ts":"2020-02-29T16:57:32.728Z"}
{"msg":"@amundson so sabre wasm interface has a few limitation which are problematic for Solang, and therefore for general adoption. I think has some general issues too (no \"free\" function for \"alloc\"). So either we expand/improve Sabre's wasm interface.","username":"seanyoung","ts":"2020-02-29T16:59:03.471Z"}
{"msg":"@amundson so sabre wasm interface has a few limitation which are problematic for Solang, and therefore for general adoption. I think it has some general issues too (no \"free\" function for \"alloc\"). So either we expand/improve Sabre's wasm interface.","username":"seanyoung","ts":"2020-02-29T16:59:03.471Z"}
{"msg":"Maybe we start with a comparison between different wasm host interfaces.","username":"seanyoung","ts":"2020-02-29T16:59:55.361Z"}
{"msg":"A wiki page would be good for this, so everyone can comment, I think.","username":"seanyoung","ts":"2020-02-29T17:00:45.636Z"}
{"msg":"I'm happy to start this since I have already spent time looking at them, in order to implement Solang targets.","username":"seanyoung","ts":"2020-02-29T17:02:00.162Z"}
{"msg":"@seanyoung what specifically is problematic? we can fix those things, if its not just a problem understanding sabre.","username":"amundson","ts":"2020-02-29T18:21:09.414Z"}
{"msg":"I'll write some notes when I have some time. Currently on holiday until HGF","username":"seanyoung","ts":"2020-03-01T01:26:38.557Z"}
{"msg":"So I've started to write my thoughts down on what common smart contract interface should look like. This needs some reviewing and probably has lots of language bugs, but I thought I'd seek early feedback:  https://github.com/seanyoung/hyperwasm","username":"seanyoung","ts":"2020-03-06T04:38:40.806Z"}
{"msg":"@amundson see https://github.com/seanyoung/hyperwasm/blob/master/existing_interfaces.md for some feedback on the sabre smart contract interface.","username":"seanyoung","ts":"2020-03-06T04:39:18.754Z"}
{"msg":"The plan is to flesh this repo out; make it a labs project and invite feedback via github pull requests and issues.\nIt needs more work, there is more to add. In the mean time any feedback now would be very welcome.","username":"seanyoung","ts":"2020-03-06T04:46:01.156Z"}
{"msg":"it also needs a name","username":"seanyoung","ts":"2020-03-06T04:46:25.892Z"}
{"msg":"It also needs a name. I've called it hyperwasm but totally open to suggestions","username":"seanyoung","ts":"2020-03-06T04:46:25.892Z"}
{"msg":"I think the spec should provide for maximum compatibility.  So there are some recommendations I think should be changed to achieve that:\n* Limit storage to 256 bits\n* Limit keys to 256 bits, and zero extend short keys.","username":"shemnon","ts":"2020-03-06T05:26:40.827Z"}
{"msg":"For the storage values longer values can be supported, but some mapping to a 256 bit storage should be standardized so there isn't key collision.  Or make a 256 bit set of APIs and a variable length stream and clients can choose which one they want (at the expense of compatability).","username":"shemnon","ts":"2020-03-06T05:28:19.324Z"}
{"msg":"The other ones are fairly deep and we need many eyes on them.","username":"shemnon","ts":"2020-03-06T05:31:00.480Z"}
{"msg":"I'm not sure I agree with limiting keys to 256 bits.  If you want to implement any kind of post-quantum cryptography, you're going to need substantially more space than that.  There are a number of other cases where you're going to need more than 256 bit keys if you want to use non-basic cryptography.","username":"hartm","ts":"2020-03-06T17:02:42.470Z"}
{"msg":"(Sorry for my dumb deleted comment earlier.)","username":"hartm","ts":"2020-03-06T18:36:26.307Z"}
{"msg":"not sure the scope of this channel, but we also have some work going on in transact to standardize how to write smart contracts (very much a next-gen of what sawtooth SDKs have currently). will remove the merkle-tree assumption (while elegantly supporting it) so that we can get wider support for other ledgers. we expect that to be the APIs folks use for writing sabre contracts once we are done with it. minimally will be supported in anything supporting sabre, so impacts sawtooth, splinter, and grid work.","username":"amundson","ts":"2020-03-06T18:44:44.959Z"}
{"msg":"Maximum compatibility is something we should aim for. Compatibility with how different ledgers approach storage, not just ethereum. Otherwise we might as well use ewasm.\nDifferent ledgers will have different limits on keys and values. So, we should use find something that works for everyone.","username":"seanyoung","ts":"2020-03-06T19:11:52.524Z"}
{"msg":"You want to reference keys indirectly so if keys are >256 bit, then so should values. Also this makes storing strings much nicer. ","username":"seanyoung","ts":"2020-03-06T19:23:05.622Z"}
{"msg":"@hartm you actually touched on an important point.\n\nIf on-chain HashMap was implemented with a simple limited bucket list and bucket chain, then a type of attack is possible where the attacker chooses keys to increase the bucket length, so that the hashmap is more like a linked list. This type of attack is usually prevented with SipHash: \nhttps://en.wikipedia.org/wiki/SipHash\n\nOn public ethereum the bytecode and contract storage is stored on-chain, thus SipHash cannot be used: there is no place to store a secret.\n\nIn Solidity, the HashMap is implemented using a crypto hash and no bucket list. This requires a large key space. We might want to increase this beyond 256 bits at some point.\n\nhttps://solidity.readthedocs.io/en/v0.6.3/types.html#mapping-types\n","username":"seanyoung","ts":"2020-03-07T16:45:11.512Z"}
{"msg":"@hartm you actually touched on an important point.\n\nIf on-chain HashMap was implemented with a simple limited bucket list and bucket chain, then a type of attack is possible where the attacker chooses keys to increase the bucket length (via hash collisions), so that the hashmap is more like a linked list. This type of attack is usually prevented with SipHash: \nhttps://en.wikipedia.org/wiki/SipHash\n\nOn public ethereum the bytecode and contract storage is stored on-chain, thus SipHash cannot be used: there is no place to store a secret.\n\nIn Solidity, the HashMap is implemented using a crypto hash and no bucket list. This requires a large key space. We might want to increase this beyond 256 bits at some point.\n\nhttps://solidity.readthedocs.io/en/v0.6.3/types.html#mapping-types\n","username":"seanyoung","ts":"2020-03-07T16:45:11.512Z"}
{"msg":"Not sure where the merkle-tree assumption is, the smart contracts host functions use key-value pairs.\n\nIt would be interesting to see what this work looks like.","username":"seanyoung","ts":"2020-03-07T17:31:19.367Z"}
{"msg":"Has joined the channel.","username":"knagware9","ts":"2020-03-12T16:49:40.430Z","type":"uj"}
{"msg":"Has joined the channel.","username":"GuilhermeLionzo","ts":"2020-03-16T13:19:58.805Z","type":"uj"}
{"msg":"Has joined the channel.","username":"gokulalex","ts":"2020-03-20T05:28:44.209Z","type":"uj"}
{"msg":"Has joined the channel.","username":"sbalikondwar","ts":"2020-04-05T13:56:54.394Z","type":"uj"}
{"msg":"hi there @seanyoung , Shivam from the mail a couple of days ago. ","username":"sbalikondwar","ts":"2020-04-05T13:57:36.248Z"}
{"msg":"currently reading on LSP protocol and paralelly trying out the Solang to wasm compilation using Solang.  ","username":"sbalikondwar","ts":"2020-04-05T14:24:24.688Z"}
{"msg":"currently reading on LSP protocol and paralelly trying out the Solang to wasm compilation using Solang( also understanding solidity syntax).  ","username":"sbalikondwar","ts":"2020-04-05T14:24:24.688Z"}
{"msg":"Hi @sbalikondwar that's great. Let me know if you have any questions.","username":"seanyoung","ts":"2020-04-05T14:42:54.701Z"}
{"msg":"So I was going through the LSP specs \nQuite a big one with lot of minute details \nI am thinking to first go with rls\nSo I am thinking about interfacing rls with Solang \nPerhaps we might be using Solang backend.","username":"sbalikondwar","ts":"2020-04-06T14:37:04.292Z"}
{"msg":"Oh I forgot hi there @seanyoung ","username":"sbalikondwar","ts":"2020-04-06T14:37:28.286Z"}
{"msg":"Progressing in this order we can write rust binaries responding to LSP ","username":"sbalikondwar","ts":"2020-04-06T14:42:09.736Z"}
{"msg":"The LSP spec is large. However we will only need a small subset","username":"seanyoung","ts":"2020-04-06T15:40:18.808Z"}
{"msg":"Actually, come to think of it, re-implementing all those messages again does not make any sense.","username":"seanyoung","ts":"2020-04-06T16:17:11.905Z"}
{"msg":"Sharing code with RLS is a good idea. Possibly the LSP code on RLS can be spun out into a crate or so. There are different ways of doing this. For now we could copy that code into solang; we won't be able to get solang merged into RLS.","username":"seanyoung","ts":"2020-04-06T16:18:31.745Z"}
{"msg":"I've spent some more time reading rust rls. The LSP messages it uses are defined in the https://crates.io/crates/lsp-types crate, so that can be used as well.\nRLS has a great structure so that can be used as a basis for SLS.","username":"seanyoung","ts":"2020-04-06T18:57:14.871Z"}
{"msg":"Has joined the channel.","username":"Dangana","ts":"2020-05-04T00:34:40.384Z","type":"uj"}
{"msg":"\n\nI did some digging in the codebase for rls and how it can help us in this process.\nThe first thing was about rust binaries, \n\nSo the server needs to respond to queries with processing the given req, for that we need a server in first place.\n\nThe rls server module can be useful as it already has function support for LSP types\n\nThe another requirement is of a client,\nNow as if we suppose there is a user IDE which will use LSP as protocol for communication\nThen a small program can be written which will first receive the current file, then send the required request as clicked from ide\nThis client will just forward them through std io \n\nOn the receiver side this server can use salsa lib of rust to buffer queries which our server processes\n\nThe Solang backend can be wired to compile this requests from server which again are given back by server to the client.\n\nThis would be integrated as a sls named dir in the current Solang codebase\n\nSls dir will have this server, LSP types , client and other required modules\n\nThen there is need to do syntax highlighting,\nWe can use the parser and resolver for it.\nI am sure parser can be hacked to give generate some special syntax tree, \nAlongside the current AST so that we can just travel this special syntax tree for all the syntax checks with the AST telling us symantic checks.\n\nThe client current can exploit the hover, code line , etc implemented functions of rls server for hover actions from user , etc.\n\nAs we know LSP is vast but I do hope the above implementation fast tracks the work and we get more time to test it alongwith features like formatting etc \n\nThis is a quite high level view from my side, what are your views about it.\n\nAlso sorry for the delay as you might know the classes were being conducted from  home and there was quite work load in past my month when I told you I was working. \nBut I managed to do some work in that period as you can see.\n","username":"sbalikondwar","ts":"2020-05-07T21:32:55.361Z"}
{"msg":"@sbalikondwar I am thinking along the same line. So the SLS will use solang as a crate. I don't there is a need for the SLS to be a separate executable from solang itself.","username":"seanyoung","ts":"2020-05-11T09:42:57.001Z"}
{"msg":"As to modifying the parser to produce the correct information we need for the language server, this  is something that I am happy to do.","username":"seanyoung","ts":"2020-05-11T09:44:03.725Z"}
{"msg":"As this requires some good knowledge of how Solang works.","username":"seanyoung","ts":"2020-05-11T09:44:38.880Z"}
{"msg":"So RLS and Solang have compatible licenses (MIT and Apache). However we should not just copy and paste the whole thing, we should trim all the bits we don't need. I think we can refine this over time though, until the final merge.","username":"seanyoung","ts":"2020-05-11T10:12:17.590Z"}
{"msg":"Well what I thought at first was by keeping sls as separate we can use it in many editor's, sort of a standalone utility working as server. The change doesn't require that much time so I think we can decide it at later at the time of packaging the implementation.\nAbout licensing if they are compatible then there is no issue, I agree to use only the most essential pieces.","username":"sbalikondwar","ts":"2020-05-11T20:11:15.210Z"}
{"msg":"Well what I thought at first was by keeping sls as separate we can use it in many editor's, sort of a standalone utility working as server. The change doesn't require that much time so I think we can decide it later at the time of packaging the implementation.\nAbout licensing if they are compatible then there is no issue, I agree to use only the most essential pieces.","username":"sbalikondwar","ts":"2020-05-11T20:11:15.210Z"}
{"msg":"Let's continue discussion on the language server in #solang @sbalikondwar ","username":"seanyoung","ts":"2020-05-14T14:40:13.359Z"}
{"msg":"I never knew there was a channel dedicated for Solang \nI thought all discussions took place here.\nCool will join in.","username":"sbalikondwar","ts":"2020-05-14T14:57:40.198Z"}
{"msg":"Has joined the channel.","username":"Kazuya.N","ts":"2021-10-30T12:42:58.259Z","type":"uj"}
{"msg":"","username":"rjones","ts":"2022-03-23T17:27:19.042Z","type":"room_changed_topic"}
{"msg":"","username":"rjones","ts":"2022-03-23T17:27:19.050Z","type":"room_changed_description"}
{"msg":"","username":"rjones","ts":"2022-03-23T17:27:19.054Z","type":"room_changed_announcement"}
