{"msg":"Has joined the channel.","username":"jsmitchell","ts":"2019-05-23T15:54:06.858Z","type":"uj"}
{"msg":"Has joined the channel.","username":"amundson","ts":"2019-05-23T15:58:30.290Z","type":"uj"}
{"msg":"Has joined the channel.","username":"DjCillers","ts":"2019-06-16T11:12:08.383Z","type":"uj"}
{"msg":"Has joined the channel.","username":"varubasi77","ts":"2019-06-18T18:55:40.940Z","type":"uj"}
{"msg":"Has joined the channel.","username":"AmimKnabben","ts":"2019-06-20T01:47:46.070Z","type":"uj"}
{"msg":"Has joined the channel.","username":"ruairih","ts":"2019-06-20T15:48:05.493Z","type":"uj"}
{"msg":"Thanks for your active participation and discussion. Slides, meeting notes, and recording will be posted on Supply Chain SIG wiki home page.\n\nA few discrete action items highlighted in red. There are action items requested by everyone in projects.\n\nAs a reminder if you have not joined a specific project yet, please consider doing so. Start by adding your name to projects, and contributing content. \n\nThank you. \n\nMeeting Minutes - 6/20/2019\n\nGeneral:\nReviewed poll result to determine SIG meeting time - Thursday, 9am PST still a top choice. Poll is opened indefinitely for everyone to vote. \nRecognized Marco Carvalho, Adnan Iftekhar, and Zaher Srour for their community leadership and enthusiastic contribution in the last two weeks \nShared a few industry news items- The retailer, Target, unveiled and open sourced project ConsenSource, that runs on sawtooth. Codebase is in GitHub, FB announced Libra, Fed government doing a study on how they may use blockchain with Booz Allen (see slides for links to articles, and repos, etc)\n\nOpen Discussions:\nSuggestion: It would be good to get an update on progress made in food consortiums, find contacts and invite them to present, make it part of the discussions: MediLedger, FoodTrust, Target’s ConsenSource (if anyone knows someone who can speak about these consortiums feel free to invite them, and we can add them to the agenda). Everyone - invite contacts from these food consortiums to come and present in our SIG meeting. \nSuggestion: Bret Carpenter will send abstract of his proposed talk on use of Geospatial info, for potential inclusion in a future SIG meeting. \nQuestion: Grid project details and code repo may be found here: https://wiki.hyperledger.org/display/GRID/Hyperledger+Grid\n\nMember Introductions: \nJoseph Catende - FL, Accountant, F500 company, Interested in Grid, access to codebase, Entrepreneur - Github. Startup - How GTM can be made into an agile process.\nBret Carpenter - Financial professional, Asset management in precious metal. Bold Forward with CDW, Inception program with Nvidia - Geospatial - Would like to present AR and Geospatial technology he is developing. \nKamlesh - Pune, India - Startup, IT, Building supply chain solutions for different sectors based on Hyperledger Fabric\nChristian Winzeler - Works in RSM, based in S. California, Food & Beverage consulting practice, interested in Food Safety\nAmim Knabben - Logistics company in NY\nWesley Graham - Oracle, Product Management, Track and Trace app, interested in defining standards \nJohn Hopkins - Track and Trace  for a cannibis startup, interested in Grid, working on Semantics Working Group working on overlays to create shared context across different ledgers\n\nProject Updates: \n\n\tFood Safety Project Meeting Notes\nAdd Ripe.io, Corda, Food Trust\nAdd more details to scope\nDeliverable suggestion - one stop shop for understanding where the industry is at, best practices, analysis of consortium models - what’s unique about them\nTalk about how these interact with outside systems - return data - how do we make it easy for getting that data in/out of blockchain - Bret has done some work in Blockchain and AWS - Integration/Interoperability heading/bullet is needed.\nVivek Ahuja & Michael Ribet from Sofbang will join this project - please add yourself to wiki.","username":"mpiekarska","ts":"2019-06-24T08:16:57.209Z"}
{"msg":"\n\n\tSupply Chain Contract Template Meeting Notes\nDefining interactions, taxonomy, participants\nStart with High level - types of smart contracts with supply chain. Then go to industry specific smart contracts (pharma, beverage, life science)\nIts not system specific - hyperledger fabric or sawtooth - that’s implementation detail. This project seeks to capture the business logic - data model, state transitions, business logic is the smart contract implementing.\nCreate a spec for smart contract logic - what capabilities should the smart contract support. \nProject Transact will be announced shortly - integration points for blockchain with supply chain processes\nBe more specific to particular supply chain sub-processes e.g. purchase orders, reconciliation, acceptance notices, etc. talking about how smart contracts deal with these sub-processes. \nDoes what asset you monitor also has an implication on smart contract logic - it should be a nuance worth covering\nOne idea - group can review BiTA specs - https://static1.squarespace.com/static/5aa97ac8372b96325bb9ad66/t/5c7e8882f9619a98a55ec24d/1551796355748/BiTAS+Location+Component+Specification+v4.pdf (Dave to check if this is current or not) - and propose smart contracts that can handle state transitions with the events.\nGS1 also has defined EPCIS for data models and state transitions, which could be used to build logic for smart contract template - https://www.gs1.org/sites/default/files/docs/epc/EPCIS-Standard-1.2-r-2016-09-29.pdf. \n\n\tUse Case Repository:\nMark and Jay to create a wiki based structure that we can use to define each use case.\nEveryone writes editable use cases (sample will be posted) on wiki for collaborative editing\nCreate categories for use cases - by industry - retail, food, pharma, discrete manufacturing, process manufacturing, logistics, etc. \n\n\tUsing Blockchain for Drug Supply Chain Security Act \nAction: Put a link to the actual DSCSA regulation document\nGovernment wants to more granuarly track drugs in supply chain\nBen shared a link to the FDA page that outlines things like MediLedger - their specs for smart contracts are on Github\nLegislation is being transformed into specs through 2023 - i.e. Unique identifier for all drugs at a salable unit level that carries though from manufacturer, to wholesaler, to pharmacy - several FDA pilots are underway\nOne use case for MediLedger is to verify returned drugs \nBaiju, Marco, Ben and others will jump on a call next week - others please add your name to wiki if you want to be included in that call.\nFDA already has a “guidance document” - Ben to provide link on wiki page - that’s already established data models, schemas, etc.\nAlso, GS1 has a spec for healthcare and pharmaceutical already - that talks about DSCSA - to frame up data models and schemas - https://www.gs1us.org/industries/healthcare/standards-in-use/pharmaceutical. For this use case, defining a schema (data model) and smart contracts to handle the type of transactions that need to be processed by a distributed solution would be a great exercise for this use case.  (\"Definition of Done\" could be completing those deliverables.)\nMarta to make introductions to GS1 team, and invite them to the next call\n","username":"mpiekarska","ts":"2019-06-24T08:17:12.430Z"}
{"msg":"Original Message here https://lists.hyperledger.org/g/supply-chain-sig/message/37","username":"mpiekarska","ts":"2019-06-24T08:18:10.589Z"}
{"msg":"Has joined the channel.","username":"changeagent","ts":"2019-07-03T20:27:08.956Z","type":"uj"}
{"msg":"Has joined the channel.","username":"kenty","ts":"2019-07-04T16:12:23.876Z","type":"uj"}
{"msg":"Has joined the channel.","username":"invaliduser","ts":"2019-07-13T13:23:00.816Z","type":"uj"}
{"msg":"Has joined the channel.","username":"Tatse","ts":"2019-07-17T05:35:44.060Z","type":"uj"}
{"msg":"Are there minutes/recordings from the July 25th meeting? I can't find them on the wiki.","username":"jsmitchell","ts":"2019-07-30T19:25:36.866Z"}
{"msg":"Has joined the channel.","username":"GhanVashishtha","ts":"2019-07-31T07:14:16.504Z","type":"uj"}
{"msg":"Has joined the channel.","username":"raccoonrat","ts":"2019-08-07T01:47:39.721Z","type":"uj"}
{"msg":"Has joined the channel.","username":"lehors","ts":"2019-08-08T16:45:28.614Z","type":"uj"}
{"msg":"Has left the channel.","username":"amundson","ts":"2019-09-26T17:17:28.042Z","type":"ul"}
{"msg":"Has joined the channel.","username":"arsulegai","ts":"2019-10-09T04:03:03.681Z","type":"uj"}
{"msg":"Has joined the channel.","username":"JitendraHushare","ts":"2019-10-16T03:19:44.638Z","type":"uj"}
{"msg":"Has joined the channel.","username":"iampukar","ts":"2019-11-28T06:19:10.822Z","type":"uj"}
{"msg":"Has joined the channel.","username":"harrywright","ts":"2019-12-18T18:06:10.588Z","type":"uj"}
{"msg":"Calling all Projects, SIG, and WG!!!  We will have a Video recording Studio setup at HGF (Hyperledger Global Forum). We are asking that all projects and groups help us create a 5 minute video about your group so that we can promote it afterward. Sign up Here! https://wiki.hyperledger.org/display/HGF/Video+Recording+Schedule","username":"Silona","ts":"2020-01-14T17:06:13.908Z"}
{"msg":"Has joined the channel.","username":"tickmatrix","ts":"2020-01-16T10:30:20.978Z","type":"uj"}
{"msg":"Has joined the channel.","username":"sankarshanm","ts":"2020-01-16T10:32:26.547Z","type":"uj"}
{"msg":"Has joined the channel.","username":"Tomomi.Yamano","ts":"2020-02-06T05:36:35.775Z","type":"uj"}
{"msg":"Hi @Silona , is that possible to know more detaild agenda for \"Pharma presentation by Priya Gopal \" being held on 20th of Feb? \nBecause it is going to be 2 am in the morning if i would particiate into this call and wanted to know if it is worth participating . ","username":"Tomomi.Yamano","ts":"2020-02-06T05:39:59.872Z"}
{"msg":"Hi @Silona , is that possible to know more detaild agenda for \"Pharma presentation by Priya Gopal \" being held on 20th of Feb? \nBecause it is going to be 2 am in the morning if i would particiate into this call and wanted to know if it is worth checking out in real time . ","username":"Tomomi.Yamano","ts":"2020-02-06T05:39:59.872Z"}
{"msg":"I'm not sure it would be best to ask the chair. If you look on their page on the wiki... It should be there. Cheers!","username":"Silona","ts":"2020-02-06T05:58:59.169Z"}
{"msg":"thanks a lot","username":"Tomomi.Yamano","ts":"2020-02-06T06:15:19.781Z"}
{"msg":"thanks a lot. Also, does anyone in the group have references indicating the data with regard to serialization being replaceable with blockchain in pharma? most of papers, reports i googled were around in 2018 which the market was at its peak ","username":"Tomomi.Yamano","ts":"2020-02-06T06:15:19.781Z"}
{"msg":"thanks a lot. Also, does anyone in the group have references indicating the data with regard to serialization being replaceable with blockchain in pharma? most of papers, reports i found were around in 2018 which the market was at its peak","username":"Tomomi.Yamano","ts":"2020-02-06T06:15:19.781Z"}
{"msg":"thanks a lot. Also, does anyone in the group have references indicating the data with regard to serialization being replaceable with blockchain in pharma? most of papers, reports i found were around in 2018 which the market was at its peak and i wonder if there is any latest reports or papers in 2019","username":"Tomomi.Yamano","ts":"2020-02-06T06:15:19.781Z"}
{"msg":"thanks a lot. Also, does anyone in the group have references indicating the data with regard to serialization being replaceable with blockchain in pharma? most of papers, reports i found were around in 2018 which market was at its peak and i wonder if there is any latest reports or papers in 2019","username":"Tomomi.Yamano","ts":"2020-02-06T06:15:19.781Z"}
{"msg":"thanks a lot. Also, does anyone in the group have references indicating the data with regard to a mention of serialization being replaceable with blockchain in pharma? most of papers, reports i found were around in 2018 which market was at its peak and i wonder if there is any latest reports or papers in 2019","username":"Tomomi.Yamano","ts":"2020-02-06T06:15:19.781Z"}
{"msg":"@Silona ","username":"Tomomi.Yamano","ts":"2020-02-06T06:15:23.764Z"}
{"msg":"Has joined the channel.","username":"ajayjadhav","ts":"2020-02-19T08:19:33.492Z","type":"uj"}
{"msg":"Hello everyone, are there any use cases being (or already) discussed in this group around the use of Blockchain/DLT in Air Cargo industry?","username":"ajayjadhav","ts":"2020-02-19T08:21:14.736Z"}
{"msg":"Has joined the channel.","username":"Patrick-Erichsen","ts":"2020-03-04T22:52:28.628Z","type":"uj"}
{"msg":"Would it be possible to get a copy of the email sent out that Brian mentioned in his keynote this morning? Around the use case that a prof from Auburn has been working. ","username":"Patrick-Erichsen","ts":"2020-03-04T22:52:28.978Z"}
{"msg":"Has joined the channel.","username":"YokeshSankar","ts":"2020-03-06T07:44:26.293Z","type":"uj"}
{"msg":"Has joined the channel.","username":"dineshthemacho1","ts":"2020-03-09T06:26:19.023Z","type":"uj"}
{"msg":"Has joined the channel.","username":"knowledgebroker","ts":"2020-05-15T02:27:05.747Z","type":"uj"}
{"msg":"Has joined the channel.","username":"matgnt","ts":"2020-05-20T14:31:44.353Z","type":"uj"}
{"msg":"Has joined the channel.","username":"hidura","ts":"2020-06-04T22:59:20.245Z","type":"uj"}
{"msg":"Has joined the channel.","username":"knagware9","ts":"2020-07-23T11:15:00.026Z","type":"uj"}
{"msg":"Has joined the channel.","username":"ever-upwards","ts":"2020-09-02T16:45:48.272Z","type":"uj"}
{"msg":"Has joined the channel.","username":"AbhinavMakker","ts":"2020-09-06T09:55:15.146Z","type":"uj"}
{"msg":"Hi, hope you all are doing good. I am a blockchain enthusiast and is proactively looking forward to contribute to this project as a developer. Kindly suggest how to embark on this journey.","username":"AbhinavMakker","ts":"2020-09-06T09:55:15.511Z"}
{"msg":"Has joined the channel.","username":"JasleenBindra","ts":"2020-09-08T17:19:45.924Z","type":"uj"}
{"msg":"Has joined the channel.","username":"mammutjaeger","ts":"2020-09-22T09:54:41.886Z","type":"uj"}
{"msg":"Hi everyone, I am interested in writing my master thesis on a supply chain-related Hyperledger Fabric use case. Is there any specific use case you are working on at the moment. I would like to set up a handy prototype. Best Regards Simon","username":"mammutjaeger","ts":"2020-09-22T09:58:10.397Z"}
{"msg":"Hi everyone, I am interested in writing my master thesis on a supply chain-related Hyperledger Fabric use case. Is there any specific use case you are working on at the moment? I would like to set up a handy prototype. Best Regards Simon","username":"mammutjaeger","ts":"2020-09-22T09:58:10.397Z"}
{"msg":"Has joined the channel.","username":"amonter5","ts":"2020-10-29T11:49:19.623Z","type":"uj"}
{"msg":"Hi everyone,\n\nMy name is Adrian founder of GST. We are a global tech community in 35+ countries and we have partnered with the Hyperledger community in the past to make connections worldwide.\n\nI just had a chat with David Boswell, and he mentioned you guys are doing webinars for the community and present projects and/or startups relating to Social impact blockchain solutions.\n\nNow, I’m reaching out because we are interested in helping those projects connect with the right partners in multiple new markets for the purpose of scaling up, finding sales, and distribution channels.\n\nWe do this through a matching engine by matching real-world organizational problems with solutions. We would love and get more data on those projects here. Check out this post https://medium.com/globalsouthtech/looking-for-teams-startups-and-projects-to-help-them-scale-up-bce9497eadfa\n\nI would love to engage further with this group and explore collaborations if any comments please just let me know\n\nThanks a lot\nAdrian","username":"amonter5","ts":"2020-10-29T11:49:21.576Z"}
{"msg":"Has joined the channel.","username":"bmsuite","ts":"2020-10-29T12:06:51.734Z","type":"uj"}
{"msg":"Has joined the channel.","username":"squarfed","ts":"2021-04-27T17:49:36.907Z","type":"uj"}
{"msg":"Has joined the channel.","username":"gusBar","ts":"2021-05-06T05:13:10.309Z","type":"uj"}
{"msg":"Has joined the channel.","username":"indranil32","ts":"2021-06-23T05:14:30.507Z","type":"uj"}
{"msg":"Has there been any initiative to support EDIs related to Supply Chains out of the box in Grid or Sawtooth ?","username":"indranil32","ts":"2021-06-23T05:17:04.572Z"}
{"msg":"Has joined the channel.","username":"DPJ","ts":"2021-07-14T03:46:26.192Z","type":"uj"}
{"msg":"Hi Adrian","username":"DPJ","ts":"2021-07-14T03:47:47.207Z"}
{"msg":"Has joined the channel.","username":"ErikValiquette","ts":"2022-01-15T00:37:00.961Z","type":"uj"}
{"msg":"Has joined the channel.","username":"Ravjot","ts":"2022-01-18T17:43:27.713Z","type":"uj"}
{"msg":"Has joined the channel.","username":"sbohanlf","ts":"2022-01-25T15:23:12.268Z","type":"uj"}
